In [36]:
import pandas as pd
import numpy as np

In [37]:
sozlukVerisi={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38]}

In [38]:
havaDurumu=pd.DataFrame(sozlukVerisi) # sözlük verisini dataframe çevirdik.

In [39]:
havaDurumu

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

havaDurumu.dropna() # veri olmayan kısımları düşürecek.

In [40]:
havaDurumu.dropna(axis=1) # nan olmayan kolonları getirdik.

   izmir
0     40
1     39
2     38

In [41]:
havaDurumu.fillna(20) # boş olan yerlerin hepsine 20 koyacak

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0    20.0     39
2      20.0    25.0     38

## groupby

In [42]:
maasSozluğu= {"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
              "çalışan ismi":["ahmet","mehmet","atil","zeynep","burak","fatma",],
               "maas":[100,200,150,250,300,400]}

In [43]:
maasData=pd.DataFrame(maasSozluğu)

In [44]:
maasData

   departman çalışan ismi  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   200
2  pazarlama         atil   150
3  pazarlama       zeynep   250
4      hukuk        burak   300
5      hukuk        fatma   400

In [45]:
grupObjesi=maasData.groupby("departman") # departmana göre grupladık.

In [46]:
grupObjesi.count()

           çalışan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [47]:
grupObjesi.mean() # ortalama vericek

           maas
departman
hukuk       350
pazarlama   200
yazılım     150

In [48]:
grupObjesi.describe() # tanıtımını yap demek.

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
pazarlama   2.0  200.0  70.710678  150.0  175.0  200.0  225.0  250.0
yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0